<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class SeedSeosTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        $seos = [
            [
                'city' =>  '北京'
                ],
                [
                'city' =>  '天津'
                ],
                [
                'city' =>  '上海'
                ],
                [
                'city' =>  '重庆'
                ],
                [
                'city' =>  '新疆'
                ],
                [
                'city' =>  '乌鲁木齐'
                ],
                [
                'city' =>  '克拉玛依'
                ],
                [
                'city' =>  '石河子'
                ],
                [
                'city' =>  '阿拉尔市'
                ],
                [
                'city' =>  '图木舒克'
                ],
                [
                'city' =>  '五家渠'
                ],
                [
                'city' =>  '哈密'
                ],
                [
                'city' =>  '吐鲁番'
                ],
                [
                'city' =>  '阿克苏'
                ],
                [
                'city' =>  '喀什'
                ],
                [
                'city' =>  '和田'
                ],
                [
                'city' =>  '伊宁'
                ],
                [
                'city' =>  '塔城'
                ],
                [
                'city' =>  '阿勒泰'
                ],
                [
                'city' =>  '奎屯'
                ],
                [
                'city' =>  '博乐'
                ],
                [
                'city' =>  '昌吉'
                ],
                [
                'city' =>  '阜康'
                ],
                [
                'city' =>  '库尔勒'
                ],
                [
                'city' =>  '阿图什'
                ],
                [
                'city' =>  '乌苏'
                ],
                [
                'city' =>  '西藏' 
                ],
                [
                'city' =>  '拉萨'
                ],
                [
                'city' =>  '县级市'
                ],
                [
                'city' =>  '日喀则'
                ],
                [
                'city' =>  '宁夏'
                ],
                [
                'city' =>  '银川'
                ],
                [
                'city' =>  '石嘴山'
                ],
                [
                'city' =>  '吴忠'
                ],
                [
                'city' =>  '固原'
                ],
                [
                'city' =>  '中卫'
                ],
                [
                'city' =>  '青铜峡'
                ],
                [
                'city' =>  '灵武市'
                ],
                [
                'city' =>  '内蒙古'
                ],
                [
                'city' =>  '呼和浩特'
                ],
                [
                'city' =>  '包头'
                ],
                [
                'city' =>  '乌海'
                ],
                [
                'city' =>  '赤峰'
                ],
                [
                'city' =>  '通辽'
                ],
                [
                'city' =>  '鄂尔多斯'
                ],
                [
                'city' =>  '呼伦贝尔'
                ],
                [
                'city' =>  '巴彦淖尔'
                ],
                [
                'city' =>  '乌兰察布'
                ],
                [
                'city' =>  '霍林郭勒市'
                ],
                [
                'city' =>  '满洲里市'
                ],
                [
                'city' =>  '牙克石市'
                ],
                [
                'city' =>  '扎兰屯市'
                ],
                [
                'city' =>  '根河市'
                ],
                [
                'city' =>  '额尔古纳市'
                ],
                [
                'city' =>  '丰镇市'
                ],
                [
                'city' =>  '锡林浩特市'
                ],
                [
                'city' =>  '二连浩特市'
                ],
                [
                'city' =>  '乌兰浩特市'
                ],
                [
                'city' =>  '阿尔山市'
                ],
                [
                'city' =>  '广西'
                ],
                [
                'city' =>  '南宁'
                ],
                [
                'city' =>  '柳州'
                ],
                [
                'city' =>  '桂林'
                ],
                [
                'city' =>  '梧州'
                ],
                [
                'city' =>  '北海'
                ],
                [
                'city' =>  '崇左'
                ],
                [
                'city' =>  '来宾'
                ],
                [
                'city' =>  '贺州'
                ],
                [
                'city' =>  '玉林'
                ],
                [
                'city' =>  '百色'
                ],
                [
                'city' =>  '河池'
                ],
                [
                'city' =>  '钦州'
                ],
                [
                'city' =>  '防城港'
                ],
                [
                'city' =>  '贵港'
                ],
                [
                'city' =>  '岑溪'
                ],
                [
                'city' =>  '凭祥'
                ],
                [
                'city' =>  '合山'
                ],
                [
                'city' =>  '北流'
                ],
                [
                'city' =>  '宜州'
                ],
                [
                'city' =>  '东兴'
                ],
                [
                'city' =>  '桂平'
                ],
                [
                'city' =>  '黑龙江'
                ],
                [
                'city' =>  '哈尔滨'
                ],
                [
                'city' =>  '大庆'
                ],
                [
                'city' =>  '齐齐哈尔'
                ],
                [
                'city' =>  '佳木斯'
                ],
                [
                'city' =>  '鸡西'
                ],
                [
                'city' =>  '鹤岗'
                ],
                [
                'city' =>  '双鸭山'
                ],
                [
                'city' =>  '牡丹江'
                ],
                [
                'city' =>  '伊春'
                ],
                [
                'city' =>  '七台河'
                ],
                [
                'city' =>  '黑河'
                ],
                [
                'city' =>  '绥化'
                ],
                [
                'city' =>  '五常'
                ],
                [
                'city' =>  '双城'
                ],
                [
                'city' =>  '尚志'
                ],
                [
                'city' =>  '纳河'
                ],
                [
                'city' =>  '虎林'
                ],
                [
                'city' =>  '密山'
                ],
                [
                'city' =>  '铁力'
                ],
                [
                'city' =>  '同江'
                ],
                [
                'city' =>  '富锦'
                ],
                [
                'city' =>  '绥芬河'
                ],
                [
                'city' =>  '海林'
                ],
                [
                'city' =>  '宁安'
                ],
                [
                'city' =>  '穆林'
                ],
                [
                'city' =>  '北安'
                ],
                [
                'city' =>  '五大连池'
                ],
                [
                'city' =>  '肇东'
                ],
                [
                'city' =>  '海伦'
                ],
                [
                'city' =>  '安达'
                ],
                [
                'city' =>  '长春'
                ],
                [
                'city' =>  '吉林'
                ],
                [
                'city' =>  '四平'
                ],
                [
                'city' =>  '辽源'
                ],
                [
                'city' =>  '通化'
                ],
                [
                'city' =>  '白山'
                ],
                [
                'city' =>  '松原'
                ],
                [
                'city' =>  '白城'
                ],
                [
                'city' =>  '九台市'
                ],
                [
                'city' =>  '榆树市'
                ],
                [
                'city' =>  '德惠市'
                ],
                [
                'city' =>  '舒兰市'
                ],
                [
                'city' =>  '桦甸市'
                ],
                [
                'city' =>  '蛟河市'
                ],
                [
                'city' =>  '磐石市'
                ],
                [
                'city' =>  '公主岭市'
                ],
                [
                'city' =>  '双辽市'
                ],
                [
                'city' =>  '梅河口市'
                ],
                [
                'city' =>  '集安市'
                ],
                [
                'city' =>  '临江市'
                ],
                [
                'city' =>  '大安市'
                ],
                [
                'city' =>  '洮南市'
                ],
                [
                'city' =>  '延吉市'
                ],
                [
                'city' =>  '图们市'
                ],
                [
                'city' =>  '敦化市'
                ],
                [
                'city' =>  '龙井市'
                ],
                [
                'city' =>  '珲春市'
                ],
                [
                'city' =>  '和龙市'
                ],
                [
                'city' =>  '辽宁'
                ],
                [
                'city' =>  '沈阳'
                ],
                [
                'city' =>  '大连'
                ],
                [
                'city' =>  '鞍山'
                ],
                [
                'city' =>  '抚顺'
                ],
                [
                'city' =>  '本溪'
                ],
                [
                'city' =>  '丹东'
                ],
                [
                'city' =>  '锦州'
                ],
                [
                'city' =>  '营口'
                ],
                [
                'city' =>  '阜新'
                ],
                [
                'city' =>  '辽阳'
                ],
                [
                'city' =>  '盘锦'
                ],
                [
                'city' =>  '铁岭'
                ],
                [
                'city' =>  '朝阳'
                ],
                [
                'city' =>  '葫芦岛'
                ],
                [
                'city' =>  '新民'
                ],
                [
                'city' =>  '瓦房店'
                ],
                [
                'city' =>  '普兰'
                ],
                [
                'city' =>  '庄河'
                ],
                [
                'city' =>  '海城'
                ],
                [
                'city' =>  '东港'
                ],
                [
                'city' =>  '凤城'
                ],
                [
                'city' =>  '凌海'
                ],
                [
                'city' =>  '北镇'
                ],
                [
                'city' =>  '大石桥'
                ],
                [
                'city' =>  '盖州'
                ],
                [
                'city' =>  '灯塔'
                ],
                [
                'city' =>  '调兵山'
                ],
                [
                'city' =>  '开原'
                ],
                [
                'city' =>  '凌源'
                ],
                [
                'city' =>  '北票'
                ],
                [
                'city' =>  '兴城'
                ],
                [
                'city' =>  '河北' 
                ],
                [
                'city' =>  '石家庄'
                ],
                [
                'city' =>  '唐山'
                ],
                [
                'city' =>  '邯郸'
                ],
                [
                'city' =>  '秦皇岛'
                ],
                [
                'city' =>  '保定'
                ],
                [
                'city' =>  '张家口'
                ],
                [
                'city' =>  '承德'
                ],
                [
                'city' =>  '廊坊'
                ],
                [
                'city' =>  '沧州'
                ],
                [
                'city' =>  '衡水'
                ],
                [
                'city' =>  '邢台'
                ],
                [
                'city' =>  '辛集市'
                ],
                [
                'city' =>  '藁城市'
                ],
                [
                'city' =>  '晋州市'
                ],
                [
                'city' =>  '新乐市'
                ],
                [
                'city' =>  '鹿泉市'
                ],
                [
                'city' =>  '遵化市'
                ],
                [
                'city' =>  '迁安市'
                ],
                [
                'city' =>  '武安市'
                ],
                [
                'city' =>  '南宫市'
                ],
                [
                'city' =>  '沙河市'
                ],
                [
                'city' =>  '涿州市'
                ],
                [
                'city' =>  '定州市'
                ],
                [
                'city' =>  '安国市'
                ],
                [
                'city' =>  '高碑店市'
                ],
                [
                'city' =>  '泊头市'
                ],
                [
                'city' =>  '任丘市'
                ],
                [
                'city' =>  '黄骅市'
                ],
                [
                'city' =>  '河间市'
                ],
                [
                'city' =>  '霸州市'
                ],
                [
                'city' =>  '三河市'
                ],
                [
                'city' =>  '冀州市'
                ],
                [
                'city' =>  '深州市'
                ],
                [
                'city' =>  '山东'
                ],
                [
                'city' =>  '济南'
                ],
                [
                'city' =>  '青岛'
                ],
                [
                'city' =>  '淄博'
                ],
                [
                'city' =>  '枣庄'
                ],
                [
                'city' =>  '东营'
                ],
                [
                'city' =>  '烟台'
                ],
                [
                'city' =>  '潍坊'
                ],
                [
                'city' =>  '济宁'
                ],
                [
                'city' =>  '泰安'
                ],
                [
                'city' =>  '威海'
                ],
                [
                'city' =>  '日照'
                ],
                [
                'city' =>  '莱芜'
                ],
                [
                'city' =>  '临沂'
                ],
                [
                'city' =>  '德州'
                ],
                [
                'city' =>  '聊城'
                ],
                [
                'city' =>  '菏泽'
                ],
                [
                'city' =>  '滨州'
                ],
                [
                'city' =>  '章丘'
                ],
                [
                'city' =>  '胶南'
                ],
                [
                'city' =>  '胶州'
                ],
                [
                'city' =>  '平度'
                ],
                [
                'city' =>  '莱西'
                ],
                [
                'city' =>  '即墨'
                ],
                [
                'city' =>  '滕州'
                ],
                [
                'city' =>  '龙口'
                ],
                [
                'city' =>  '莱阳'
                ],
                [
                'city' =>  '莱州'
                ],
                [
                'city' =>  '招远'
                ],
                [
                'city' =>  '蓬莱'
                ],
                [
                'city' =>  '栖霞'
                ],
                [
                'city' =>  '海阳'
                ],
                [
                'city' =>  '青州'
                ],
                [
                'city' =>  '诸城'
                ],
                [
                'city' =>  '安丘'
                ],
                [
                'city' =>  '高密'
                ],
                [
                'city' =>  '昌邑'
                ],
                [
                'city' =>  '兖州'
                ],
                [
                'city' =>  '曲阜'
                ],
                [
                'city' =>  '邹城'
                ],
                [
                'city' =>  '乳山'
                ],
                [
                'city' =>  '文登'
                ],
                [
                'city' =>  '荣成'
                ],
                [
                'city' =>  '乐陵'
                ],
                [
                'city' =>  '临清'
                ],
                [
                'city' =>  '禹城'
                ],
                [
                'city' =>  '江苏'
                ],
                [
                'city' =>  '南京'
                ],
                [
                'city' =>  '镇江'
                ],
                [
                'city' =>  '常州'
                ],
                [
                'city' =>  '无锡'
                ],
                [
                'city' =>  '苏州'
                ],
                [
                'city' =>  '徐州'
                ],
                [
                'city' =>  '连云港'
                ],
                [
                'city' =>  '淮安'
                ],
                [
                'city' =>  '盐城'
                ],
                [
                'city' =>  '扬州'
                ],
                [
                'city' =>  '泰州'
                ],
                [
                'city' =>  '南通'
                ],
                [
                'city' =>  '宿迁'
                ],
                [
                'city' =>  '江阴市'
                ],
                [
                'city' =>  '宜兴市'
                ],
                [
                'city' =>  '邳州市'
                ],
                [
                'city' =>  '新沂市'
                ],
                [
                'city' =>  '金坛市'
                ],
                [
                'city' =>  '溧阳市'
                ],
                [
                'city' =>  '常熟市'
                ],
                [
                'city' =>  '张家港市'
                ],
                [
                'city' =>  '太仓市'
                ],
                [
                'city' =>  '昆山市'
                ],
                [
                'city' =>  '吴江市'
                ],
                [
                'city' =>  '如皋市'
                ],
                [
                'city' =>  '通州市'
                ],
                [
                'city' =>  '海门市'
                ],
                [
                'city' =>  '启东市'
                ],
                [
                'city' =>  '东台市'
                ],
                [
                'city' =>  '大丰市'
                ],
                [
                'city' =>  '高邮市'
                ],
                [
                'city' =>  '江都市'
                ],
                [
                'city' =>  '仪征市'
                ],
                [
                'city' =>  '丹阳市'
                ],
                [
                'city' =>  '扬中市'
                ],
                [
                'city' =>  '句容市'
                ],
                [
                'city' =>  '泰兴市'
                ],
                [
                'city' =>  '姜堰市'
                ],
                [
                'city' =>  '靖江市'
                ],
                [
                'city' =>  '兴化市'
                ],
                [
                'city' =>  '安徽'
                ],
                [
                'city' =>  '合肥'
                ],
                [
                'city' =>  '蚌埠'
                ],
                [
                'city' =>  '芜湖'
                ],
                [
                'city' =>  '淮南'
                ],
                [
                'city' =>  '亳州'
                ],
                [
                'city' =>  '阜阳'
                ],
                [
                'city' =>  '淮北'
                ],
                [
                'city' =>  '宿州'
                ],
                [
                'city' =>  '滁州'
                ],
                [
                'city' =>  '安庆'
                ],
                [
                'city' =>  '巢湖'
                ],
                [
                'city' =>  '马鞍山'
                ],
                [
                'city' =>  '宣城'
                ],
                [
                'city' =>  '黄山'
                ],
                [
                'city' =>  '池州'
                ],
                [
                'city' =>  '铜陵'
                ],
                [
                'city' =>  '界首'
                ],
                [
                'city' =>  '天长'
                ],
                [
                'city' =>  '明光'
                ],
                [
                'city' =>  '桐城'
                ],
                [
                'city' =>  '宁国'
                ],
                [
                'city' =>  '浙江'
                ],
                [
                'city' =>  '杭州'
                ],
                [
                'city' =>  '嘉兴'
                ],
                [
                'city' =>  '湖州'
                ],
                [
                'city' =>  '宁波'
                ],
                [
                'city' =>  '金华'
                ],
                [
                'city' =>  '温州'
                ],
                [
                'city' =>  '丽水'
                ],
                [
                'city' =>  '绍兴'
                ],
                [
                'city' =>  '衢州'
                ],
                [
                'city' =>  '舟山'
                ],
                [
                'city' =>  '台州'
                ],
                [
                'city' =>  '建德市'
                ],
                [
                'city' =>  '富阳市'
                ],
                [
                'city' =>  '临安市'
                ],
                [
                'city' =>  '余姚市'
                ],
                [
                'city' =>  '慈溪市'
                ],
                [
                'city' =>  '奉化市'
                ],
                [
                'city' =>  '瑞安市'
                ],
                [
                'city' =>  '乐清市'
                ],
                [
                'city' =>  '海宁市'
                ],
                [
                'city' =>  '平湖市'
                ],
                [
                'city' =>  '桐乡市'
                ],
                [
                'city' =>  '诸暨市'
                ],
                [
                'city' =>  '上虞市'
                ],
                [
                'city' =>  '嵊州市'
                ],
                [
                'city' =>  '兰溪市'
                ],
                [
                'city' =>  '义乌市'
                ],
                [
                'city' =>  '东阳市'
                ],
                [
                'city' =>  '永康市'
                ],
                [
                'city' =>  '江山市'
                ],
                [
                'city' =>  '临海市'
                ],
                [
                'city' =>  '温岭市'
                ],
                [
                'city' =>  '龙泉市'
                ],
                [
                'city' =>  '福建'
                ],
                [
                'city' =>  '福州'
                ],
                [
                'city' =>  '厦门'
                ],
                [
                'city' =>  '泉州'
                ],
                [
                'city' =>  '三明'
                ],
                [
                'city' =>  '南平'
                ],
                [
                'city' =>  '漳州'
                ],
                [
                'city' =>  '莆田'
                ],
                [
                'city' =>  '宁德'
                ],
                [
                'city' =>  '龙岩'
                ],
                [
                'city' =>  '福清市'
                ],
                [
                'city' =>  '长乐市'
                ],
                [
                'city' =>  '永安市'
                ],
                [
                'city' =>  '石狮市'
                ],
                [
                'city' =>  '晋江市'
                ],
                [
                'city' =>  '南安市'
                ],
                [
                'city' =>  '龙海市'
                ],
                [
                'city' =>  '邵武市'
                ],
                [
                'city' =>  '武夷山'
                ],
                [
                'city' =>  '建瓯市'
                ],
                [
                'city' =>  '建阳市'
                ],
                [
                'city' =>  '漳平市'
                ],
                [
                'city' =>  '福安市'
                ],
                [
                'city' =>  '福鼎市'
                ],
                [
                'city' =>  '广东'
                ],
                [
                'city' =>  '广州'
                ],
                [
                'city' =>  '深圳'
                ],
                [
                'city' =>  '汕头'
                ],
                [
                'city' =>  '惠州'
                ],
                [
                'city' =>  '珠海'
                ],
                [
                'city' =>  '揭阳'
                ],
                [
                'city' =>  '佛山'
                ],
                [
                'city' =>  '河源'
                ],
                [
                'city' =>  '阳江'
                ],
                [
                'city' =>  '茂名'
                ],
                [
                'city' =>  '湛江'
                ],
                [
                'city' =>  '梅州'
                ],
                [
                'city' =>  '肇庆'
                ],
                [
                'city' =>  '韶关'
                ],
                [
                'city' =>  '潮州'
                ],
                [
                'city' =>  '东莞'
                ],
                [
                'city' =>  '中山'
                ],
                [
                'city' =>  '清远'
                ],
                [
                'city' =>  '江门'
                ],
                [
                'city' =>  '汕尾'
                ],
                [
                'city' =>  '云浮'
                ],
                [
                'city' =>  '增城市'
                ],
                [
                'city' =>  '从化市'
                ],
                [
                'city' =>  '乐昌市'
                ],
                [
                'city' =>  '南雄市'
                ],
                [
                'city' =>  '台山市'
                ],
                [
                'city' =>  '开平市'
                ],
                [
                'city' =>  '鹤山市'
                ],
                [
                'city' =>  '恩平市'
                ],
                [
                'city' =>  '廉江市'
                ],
                [
                'city' =>  '雷州市' 
                ],
                [
                'city' =>  '吴川市'
                ],
                [
                'city' =>  '高州市'
                ],
                [
                'city' =>  '化州市'
                ],
                [
                'city' =>  '高要市'
                ],
                [
                'city' =>  '四会市'
                ],
                [
                'city' =>  '兴宁市'
                ],
                [
                'city' =>  '陆丰市'
                ],
                [
                'city' =>  '阳春市'
                ],
                [
                'city' =>  '英德市'
                ],
                [
                'city' =>  '连州市'
                ],
                [
                'city' =>  '普宁市'
                ],
                [
                'city' =>  '罗定市'
                ],
                [
                'city' =>  '信宜市'
                ],
                [
                'city' =>  '海南'
                ],
                [
                'city' =>  '海口'
                ],
                [
                'city' =>  '三亚'
                ],
                [
                'city' =>  '琼海'
                ],
                [
                'city' =>  '文昌'
                ],
                [
                'city' =>  '万宁'
                ],
                [
                'city' =>  '五指山'
                ],
                [
                'city' =>  '儋州'
                ],
                [
                'city' =>  '东方'
                ],
                [
                'city' =>  '云南'
                ],
                [
                'city' =>  '昆明'
                ],
                [
                'city' =>  '曲靖'
                ],
                [
                'city' =>  '玉溪'
                ],
                [
                'city' =>  '保山'
                ],
                [
                'city' =>  '昭通'
                ],
                [
                'city' =>  '丽江'
                ],
                [
                'city' =>  '普洱'
                ],
                [
                'city' =>  '临沧'
                ],
                [
                'city' =>  '安宁市'
                ],
                [
                'city' =>  '宣威市'
                ],
                [
                'city' =>  '个旧市'
                ],
                [
                'city' =>  '开远市'
                ],
                [
                'city' =>  '景洪市'
                ],
                [
                'city' =>  '楚雄市'
                ],
                [
                'city' =>  '大理市'
                ],
                [
                'city' =>  '潞西市'
                ],
                [
                'city' =>  '瑞丽市'
                ],
                [
                'city' =>  '贵州'
                ],
                [
                'city' =>  '贵阳'
                ],
                [
                'city' =>  '六盘水'
                ],
                [
                'city' =>  '遵义'
                ],
                [
                'city' =>  '安顺'
                ],
                [
                'city' =>  '清镇市'
                ],
                [
                'city' =>  '赤水市'
                ],
                [
                'city' =>  '仁怀市'
                ],
                [
                'city' =>  '铜仁市'
                ],
                [
                'city' =>  '毕节市'
                ],
                [
                'city' =>  '兴义市'
                ],
                [
                'city' =>  '凯里市'
                ],
                [
                'city' =>  '都匀市'
                ],
                [
                'city' =>  '福泉市'
                ],
                [
                'city' =>  '四川'
                ],
                [
                'city' =>  '成都'
                ],
                [
                'city' =>  '绵阳'
                ],
                [
                'city' =>  '德阳'
                ],
                [
                'city' =>  '广元'
                ],
                [
                'city' =>  '自贡'
                ],
                [
                'city' =>  '攀枝花'
                ],
                [
                'city' =>  '乐山'
                ],
                [
                'city' =>  '南充'
                ],
                [
                'city' =>  '内江'
                ],
                [
                'city' =>  '遂宁'
                ],
                [
                'city' =>  '广安'
                ],
                [
                'city' =>  '泸州'
                ],
                [
                'city' =>  '达州'
                ],
                [
                'city' =>  '眉山'
                ],
                [
                'city' =>  '宜宾'
                ],
                [
                'city' =>  '雅安'
                ],
                [
                'city' =>  '资阳'
                ],
                [
                'city' =>  '都江堰市'
                ],
                [
                'city' =>  '彭州市'
                ],
                [
                'city' =>  '邛崃市'
                ],
                [
                'city' =>  '崇州市'
                ],
                [
                'city' =>  '广汉市'
                ],
                [
                'city' =>  '什邡市'
                ],
                [
                'city' =>  '绵竹市'
                ],
                [
                'city' =>  '江油市'
                ],
                [
                'city' =>  '峨眉山市'
                ],
                [
                'city' =>  '阆中市'
                ],
                [
                'city' =>  '华蓥市'
                ],
                [
                'city' =>  '万源市'
                ],
                [
                'city' =>  '简阳市'
                ],
                [
                'city' =>  '西昌市'
                ],
                [
                'city' =>  '湖南'
                ],
                [
                'city' =>  '长沙'
                ],
                [
                'city' =>  '株洲'
                ],
                [
                'city' =>  '湘潭'
                ],
                [
                'city' =>  '衡阳'
                ],
                [
                'city' =>  '岳阳'
                ],
                [
                'city' =>  '郴州'
                ],
                [
                'city' =>  '永州'
                ],
                [
                'city' =>  '邵阳'
                ],
                [
                'city' =>  '怀化'
                ],
                [
                'city' =>  '常德'
                ],
                [
                'city' =>  '益阳'
                ],
                [
                'city' =>  '张家界'
                ],
                [
                'city' =>  '娄底'
                ],
                [
                'city' =>  '浏阳市'
                ],
                [
                'city' =>  '醴陵市'
                ],
                [
                'city' =>  '湘乡市'
                ],
                [
                'city' =>  '韶山市'
                ],
                [
                'city' =>  '耒阳市'
                ],
                [
                'city' =>  '常宁市'
                ],
                [
                'city' =>  '武冈市'
                ],
                [
                'city' =>  '临湘市'
                ],
                [
                'city' =>  '汨罗市'
                ],
                [
                'city' =>  '津市市'
                ],
                [
                'city' =>  '沅江市'
                ],
                [
                'city' =>  '资兴市'
                ],
                [
                'city' =>  '洪江市'
                ],
                [
                'city' =>  '冷水江市'
                ],
                [
                'city' =>  '涟源市'
                ],
                [
                'city' =>  '吉首市'
                ],
                [
                'city' =>  '湖北'
                ],
                [
                'city' =>  '武汉'
                ],
                [
                'city' =>  '襄樊'
                ],
                [
                'city' =>  '宜昌'
                ],
                [
                'city' =>  '黄石'
                ],
                [
                'city' =>  '鄂州'
                ],
                [
                'city' =>  '随州'
                ],
                [
                'city' =>  '荆州'
                ],
                [
                'city' =>  '荆门'
                ],
                [
                'city' =>  '十堰'
                ],
                [
                'city' =>  '孝感'
                ],
                [
                'city' =>  '黄冈'
                ],
                [
                'city' =>  '咸宁'
                ],
                [
                'city' =>  '大冶市'
                ],
                [
                'city' =>  '丹江口市'
                ],
                [
                'city' =>  '洪湖市'
                ],
                [
                'city' =>  '石首市'
                ],
                [
                'city' =>  '松滋市'
                ],
                [
                'city' =>  '宜都市'
                ],
                [
                'city' =>  '当阳市'
                ],
                [
                'city' =>  '枝江市'
                ],
                [
                'city' =>  '老河口市'
                ],
                [
                'city' =>  '枣阳市'
                ],
                [
                'city' =>  '宜城市'
                ],
                [
                'city' =>  '钟祥市'
                ],
                [
                'city' =>  '应城市'
                ],
                [
                'city' =>  '安陆市'
                ],
                [
                'city' =>  '汉川市'
                ],
                [
                'city' =>  '麻城市'
                ],
                [
                'city' =>  '武穴市'
                ],
                [
                'city' =>  '赤壁市'
                ],
                [
                'city' =>  '广水市'
                ],
                [
                'city' =>  '仙桃市'
                ],
                [
                'city' =>  '天门市'
                ],
                [
                'city' =>  '潜江市'
                ],
                [
                'city' =>  '恩施市'
                ],
                [
                'city' =>  '利川市'
                ],
                [
                'city' =>  '河南'
                ],
                [
                'city' =>  '郑州'
                ],
                [
                'city' =>  '洛阳'
                ],
                [
                'city' =>  '开封'
                ],
                [
                'city' =>  '漯河'
                ],
                [
                'city' =>  '安阳'
                ],
                [
                'city' =>  '新乡'
                ],
                [
                'city' =>  '周口'
                ],
                [
                'city' =>  '三门峡'
                ],
                [
                'city' =>  '焦作'
                ],
                [
                'city' =>  '平顶山'
                ],
                [
                'city' =>  '信阳'
                ],
                [
                'city' =>  '南阳'
                ],
                [
                'city' =>  '鹤壁'
                ],
                [
                'city' =>  '濮阳'
                ],
                [
                'city' =>  '许昌'
                ],
                [
                'city' =>  '商丘'
                ],
                [
                'city' =>  '驻马店'
                ],
                [
                'city' =>  '巩义市'
                ],
                [
                'city' =>  '新郑市'
                ],
                [
                'city' =>  '新密市'
                ],
                [
                'city' =>  '登封市'
                ],
                [
                'city' =>  '荥阳市'
                ],
                [
                'city' =>  '偃师市'
                ],
                [
                'city' =>  '汝州市'
                ],
                [
                'city' =>  '舞钢市'
                ],
                [
                'city' =>  '林州市'
                ],
                [
                'city' =>  '卫辉市'
                ],
                [
                'city' =>  '辉县市'
                ],
                [
                'city' =>  '沁阳市'
                ],
                [
                'city' =>  '孟州市'
                ],
                [
                'city' =>  '禹州市'
                ],
                [
                'city' =>  '长葛市'
                ],
                [
                'city' =>  '义马市'
                ],
                [
                'city' =>  '灵宝市'
                ],
                [
                'city' =>  '邓州市'
                ],
                [
                'city' =>  '永城市'
                ],
                [
                'city' =>  '项城市'
                ],
                [
                'city' =>  '济源市'
                ],
                [
                'city' =>  '山西'
                ],
                [
                'city' =>  '太原'
                ],
                [
                'city' =>  '大同'
                ],
                [
                'city' =>  '忻州'
                ],
                [
                'city' =>  '阳泉'
                ],
                [
                'city' =>  '长治'
                ],
                [
                'city' =>  '晋城'
                ],
                [
                'city' =>  '朔州'
                ],
                [
                'city' =>  '晋中'
                ],
                [
                'city' =>  '运城'
                ],
                [
                'city' =>  '临汾'
                ],
                [
                'city' =>  '吕梁'
                ],
                [
                'city' =>  '古交'
                ],
                [
                'city' =>  '潞城'
                ],
                [
                'city' =>  '高平'
                ],
                [
                'city' =>  '介休'
                ],
                [
                'city' =>  '永济'
                ],
                [
                'city' =>  '河津'
                ],
                [
                'city' =>  '原平'
                ],
                [
                'city' =>  '侯马'
                ],
                [
                'city' =>  '霍州'
                ],
                [
                'city' =>  '孝义'
                ],
                [
                'city' =>  '汾阳'
                ],
                [
                'city' =>  '陕西'
                ],
                [
                'city' =>  '西安'
                ],
                [
                'city' =>  '咸阳'
                ],
                [
                'city' =>  '铜川'
                ],
                [
                'city' =>  '延安'
                ],
                [
                'city' =>  '宝鸡'
                ],
                [
                'city' =>  '渭南'
                ],
                [
                'city' =>  '汉中'
                ],
                [
                'city' =>  '安康'
                ],
                [
                'city' =>  '商洛'
                ],
                [
                'city' =>  '榆林'
                ],
                [
                'city' =>  '兴平市'
                ],
                [
                'city' =>  '韩城市'
                ],
                [
                'city' =>  '华阴市'
                ],
                [
                'city' =>  '甘肃'
                ],
                [
                'city' =>  '兰州'
                ],
                [
                'city' =>  '天水'
                ],
                [
                'city' =>  '平凉'
                ],
                [
                'city' =>  '酒泉'
                ],
                [
                'city' =>  '嘉峪关'
                ],
                [
                'city' =>  '金昌'
                ],
                [
                'city' =>  '白银'
                ],
                [
                'city' =>  '武威'
                ],
                [
                'city' =>  '张掖'
                ],
                [
                'city' =>  '庆阳'
                ],
                [
                'city' =>  '定西'
                ],
                [
                'city' =>  '陇南'
                ],
                [
                'city' =>  '玉门市'
                ],
                [
                'city' =>  '敦煌市'
                ],
                [
                'city' =>  '临夏市'
                ],
                [
                'city' =>  '合作市'
                ],
                [
                'city' =>  '青海'
                ],
                [
                'city' =>  '西宁'
                ],
                [
                'city' =>  '格尔木'
                ],
                [
                'city' =>  '德令哈'
                ],
                [
                'city' =>  '江西'
                ],
                [
                'city' =>  '南昌'
                ],
                [
                'city' =>  '九江'
                ],
                [
                'city' =>  '赣州'
                ],
                [
                'city' =>  '吉安'
                ],
                [
                'city' =>  '鹰潭'
                ],
                [
                'city' =>  '上饶'
                ],
                [
                'city' =>  '萍乡'
                ],
                [
                'city' =>  '景德镇'
                ],
                [
                'city' =>  '新余'
                ],
                [
                'city' =>  '宜春'
                ],
                [
                'city' =>  '抚州'
                ],
                [
                'city' =>  '乐平市'
                ],
                [
                'city' =>  '瑞昌市'
                ],
                [
                'city' =>  '贵溪市'
                ],
                [
                'city' =>  '瑞金市'
                ],
                [
                'city' =>  '南康市'
                ],
                [
                'city' =>  '井冈山市'
                ],
                [
                'city' =>  '丰城市'
                ],
                [
                'city' =>  '樟树市'
                ],
                [
                'city' =>  '高安市'
                ],
                [
                'city' =>  '德兴市'
                ],
                [
                'city' =>  '台湾'
                ],
                [
                'city' =>  '台北'
                ],
                [
                'city' =>  '台中'
                ],
                [
                'city' =>  '基隆'
                ],
                [
                'city' =>  '高雄'
                ],
                [
                'city' =>  '台南'
                ],
                [
                'city' =>  '新竹'
                ],
                [
                'city' =>  '嘉义'
                ],
                [
                'city' =>  '板桥市'
                ],
                [
                'city' =>  '宜兰市'
                ],
                [
                'city' =>  '竹北市'
                ],
                [
                'city' =>  '桃园市'
                ],
                [
                'city' =>  '苗栗市'
                ],
                [
                'city' =>  '丰原市'
                ],
                [
                'city' =>  '彰化市'
                ],
                [
                'city' =>  '南投市'
                ],
                [
                'city' =>  '太保市'
                ],
                [
                'city' =>  '斗六市'
                ],
                [
                'city' =>  '新营市'
                ],
                [
                'city' =>  '凤山市'
                ],
                [
                'city' =>  '屏东市'
                ],
                [
                'city' =>  '台东市'
                ],
                [
                'city' =>  '花莲市'
                ],
                [
                'city' =>  '马公市'
                ],
                [
                'city' =>  '香港'
                ],
                [
                'city' =>  '澳门'
                ],
        ];

        DB::table('seos')->insert($seos);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('seos')->truncate();
    }
}
